run/channel/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(

    (0 0 0)
    (6 0 0)
    (9 0 0)
    (30 0 0)
    
    (0 2 0)
    (6 2 0)
    (9 2 0)
    (30 2 0)
    
    (0 5 0)
    (6 5 0)
    (9 5 0)
    (30 5 0)
    
    (0 7 0)
    (6 7 0)
    (9 7 0)
    (30 7 0)
    
    (0 0 5)
    (6 0 5)
    (9 0 5)
    (30 0 5)
    
    (0 2 5)
    (6 2 5)
    (9 2 5)
    (30 2 5)
    
    (0 5 5)
    (6 5 5)
    (9 5 5)
    (30 5 5)
    
    (0 7 5)
    (6 7 5)
    (9 7 5)
    (30 7 5)
    
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (30 10 1) simpleGrading (.2 .2 1)
    hex (4 5 9 8 20 21 25 24) (30 10 1) simpleGrading (.2 1 1)
    hex (8 9 13 12 24 25 29 28) (30 10 1) simpleGrading (.2 5 1)
    hex (1 2 6 5 17 18 22 21) (15 10 1) simpleGrading (1 .2 1)
    hex (9 10 14 13 25 26 30 29) (15 10 1) simpleGrading (1 5 1)
    hex (2 3 7 6 18 19 23 22) (105 10 1) simpleGrading (5 .2 1)
    hex (6 7 11 10 22 23 27 26) (105 10 1) simpleGrading (5 1 1)
    hex (10 11 15 14 26 27 31 30) (105 10 1) simpleGrading (5 5 1)
);

edges
(
);

boundary
(

    inlet
    {
        type wall;
        faces
        (
        	(12 8 24 28)
        	(8 4 20 24)
        	(4 0 16 20)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
        	(3 7 23 19)
        	(7 11 27 23)
        	(11 15 31 27)
        );
    }
    
    top
    {
        type wall;
        faces
        (
        	(13 12 28 29)
        	(14 13 29 30)
        	(15 14 30 31)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
        	(0 1 17 16)
        	(1 2 18 17)
        	(2 3 19 18)
        );
    }
    
    interface
    {
        type wall;
        faces
        (
        	(5 9 25 21)
        	(9 10 26 25)
        	(10 6 22 26)
        	(6 5 21 22)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
