run/channel/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       8495;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       8525;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       8555;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       8705;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       8855;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8700;
        startFace       8905;
    }
)

// ************************************************************************* //
